Revit 2027 API
FabricationServiceSettings.GetFabricationServiceSettings Method
 Gets the settings element in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationServiceSettings GetFabricationServiceSettings(
	Document doc
)
Public Shared Function GetFabricationServiceSettings (
	doc As Document
) As FabricationServiceSettings
public:
static FabricationServiceSettings^ GetFabricationServiceSettings(
	Document^ doc
)
static member GetFabricationServiceSettings :
        doc : Document -> FabricationServiceSettings
Parameters
doc Document
 The document where the settings element is found.
Return Value
FabricationServiceSettings
 The element which stores the fabrication service settings for the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace